app/views/filenames/index.html.erb

SELECT "fileversions".* FROM "fileversions" WHERE "fileversions"."filename_id" = 1 ORDER BY "fileversions"."id" DESC LIMIT 1
---
    <td><%= filename.project.name %></td>
    <td><%= filename.fileversions.first || 0 %></td>