app/controllers/fileversions_controller.rb

SELECT "fileversions".* FROM "fileversions"
---
  def index
    @fileversions = Fileversion.all

SELECT "fileversions".* FROM "fileversions" WHERE "fileversions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @fileversion = Fileversion.find(params[:id])

INSERT INTO "fileversions" ("created_at", "download_times", "file_size", "file_version", "filename_id", "update_time", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @fileversion = Fileversion.new(params[:fileversion])

    respond_to do |format|
      if @fileversion.save