app/controllers/filenames_controller.rb

  def index
    #@filenames = Filename.all
    @search = Filename.search(params[:q])
---
SELECT "filenames".* FROM "filenames"

  def show
    @filename = Filename.find(params[:id])
---
SELECT "filenames".* FROM "filenames" WHERE "filenames"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @filename = Filename.find(params[:id])
---
SELECT "filenames".* FROM "filenames" WHERE "filenames"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @filename = Filename.new(params[:filename])

    respond_to do |format|
      if @filename.save
---
INSERT INTO "filenames" ("created_at", "name", "project_id", "source_addr", "update_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 07 Sep 2013 07:42:15 UTC +00:00], ["name", "file_0"], ["project_id", 1], ["source_addr", nil], ["update_type", "static"], ["updated_at", Sat, 07 Sep 2013 07:42:15 UTC +00:00]]